
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры



&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные); 
	
    //++ Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 19.03.2025
	
	ПересчитатьТаблицу();
	
    //-- Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 19.03.2025

	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
	//++ Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 19.03.2025
	
	ПересчитатьТаблицу();
	
   //-- Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 19.03.2025
	
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

//@skip-check org.eclipse.xtext.diagnostics.Diagnostic.Syntax
//@skip-check org.eclipse.xtext.diagnostics.Diagnostic.Syntax
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
		//++ Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025

	
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество; 
	   		
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * (ТекущиеДанные.Цена - ТекущиеДанные.Цена * (Объект.СогласованнаяСкидка+ТекущиеДанные.Скидка)/100); 
	
	
		
	
	//РассчитатьСуммуДокумента();
	
	//-- Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025

	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ПересчитатьТаблицу()
	
 //++ Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025, 19.03.2025

 
    Для каждого Строка Из Объект.Товары Цикл
    	
		Цена = Строка.Цена;
		
		Количество = Строка.Количество;
		
		Скидка = Строка.Скидка;
		
		Если Строка.Скидка + Объект.СогласованнаяСкидка < 100 Тогда
			
			Строка.Сумма = Строка.Количество * (Строка.Цена - Строка.Цена * (Объект.СогласованнаяСкидка+Строка.Скидка)/100);
			
		Иначе
			Строка.Сумма = 0;
			Сообщить("Скидка больше 100%");
		КонецЕсли;	
		КонецЦикла;
		
    
    Для каждого Строка Из Объект.Услуги Цикл
    	
    	Цена = Строка.Цена;
    	
    	Количество = Строка.Количество;
		
		Скидка =Строка.Скидка;
    	
    	Строка.Сумма = Строка.Количество * (Строка.Цена - Строка.Цена * (Объект.СогласованнаяСкидка+Строка.Скидка)/100);  
    	
    КонецЦикла;
    
    Объект.СуммаДокумента = (Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма"));   

	//-- Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025, 19.03.2025
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриИзмененииСогласованнаяСкидка(Элемент)    
	
	//++ Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025

	
	Если ЗначениеЗаполнено(Объект.Товары) = Ложь И ЗначениеЗаполнено(Объект.Услуги) = Ложь 
		Тогда
		Возврат;	
	Иначе
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Вы хотите пересчитать сумму с учетом скидки?'"),РежимДиалогаВопрос.ДаНет, 0);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ПересчитатьТаблицу();
			
		КонецЕсли;
		
	КонецЕсли;  
  //-- Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025



#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицу1(Команда)
	//++ Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025
	
	ПересчитатьТаблицу(); 
	
	//-- Побожая Задача "Добавление объектов методанных, стоящих на поддержке" 11.03.2025
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
                     

#КонецОбласти

