  
  #Область ПрограммныйИнтерфейс
   
   Процедура ДополнитьФорму(Форма) Экспорт
	   
	   ИмяФормы =Форма.ИмяФормы;  
	   
	   Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		   ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		   ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
	   ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		   ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	   ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		   ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	   ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		   ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	   ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		   ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	   КонецЕсли; 
	   
   КонецПроцедуры 
   
   #КонецОбласти
   
   #Область СлужебныйПрограммныйИнтерфейс 
   
   Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	   
	   ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	   ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо"; 
	   
   КонецПроцедуры
   
   Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	   
	   ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	   ПолеВвода.ПутьКДанным = "Объект.КонтактноеЛицо";
	   
   КонецПроцедуры 
   
   Процедура   ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
	   
	   ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаЛево);
	   ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	   ПолеВвода.ПутьКДанным = "Объект.СогласованнаяСкидка"; 
	   ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСогласованнаяСкидка");
	   
   КонецПроцедуры 


   
   #КонецОбласти    
   
